In [421]:
#Importamos la libreria de Panda y de Numpy
import pandas as pd
import numpy as np

In [422]:
#Importamos tres files .cvs como DataFrame

df1= pd.read_csv('C:/Users/aguva/IronAgustin/lab-customer-analysis-round-1/files_for_lab/csv_files/file1.csv')
df2= pd.read_csv('C:/Users/aguva/IronAgustin/lab-customer-analysis-round-1/files_for_lab/csv_files/file2.csv')
df3= pd.read_csv('C:/Users/aguva/IronAgustin/lab-customer-analysis-round-1/files_for_lab/csv_files/file3.csv')

In [423]:
#Show the DataFrame Shape

df1.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [424]:
df1.shape

(4008, 11)

In [425]:
df2.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount,Policy Type,Vehicle Class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.2,Special Auto,SUV
2,MY31220,California,F,College,899704.02%,54230,112,1/0/00,537.6,Personal Auto,Two-Door Car
3,UH35128,Oregon,F,College,2580706.30%,71210,214,1/1/00,1027.2,Personal Auto,Luxury Car
4,WH52799,Arizona,F,College,380812.21%,94903,94,1/0/00,451.2,Corporate Auto,Two-Door Car

In [426]:
df2.shape

(996, 11)

In [427]:
df3.head()

,Customer,State,Customer Lifetime Value,Education,Gender,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Total Claim Amount,Vehicle Class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car
2,ZL73902,Nevada,3265.156348,Bachelor,F,25820,82,0,Personal Auto,393.600000,Four-Door Car
3,KX23516,California,4455.843406,High School or Below,F,0,121,0,Personal Auto,699.615192,SUV
4,FN77294,California,7704.958480,High School or Below,M,30366,101,2,Personal Auto,484.800000,SUV

In [428]:
df3.shape

(7070, 11)

In [429]:
#Realizamos una copia de seguridad para no trabajar sobre archivo base.
df_101 = df1.copy()
df_201= df2.copy()
df_301= df3.copy()

### Modficamos las comlumnas para dejarlas todas en minuscula

In [430]:
column_1=[]

In [431]:
df_101.columns

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')

In [432]:
for i in range(len(df_101.columns)):
    column_1.append(df_101.columns[i].lower())

In [433]:
column_2=[]

In [434]:
df_201.columns

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Total Claim Amount', 'Policy Type', 'Vehicle Class'],
      dtype='object')

In [435]:
for i in range(len(df_201.columns)):
    column_2.append(df_201.columns[i].lower())

In [436]:
column_3=[]

In [437]:
df_301.columns

Index(['Customer', 'State', 'Customer Lifetime Value', 'Education', 'Gender',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Total Claim Amount', 'Vehicle Class'],
      dtype='object')

In [438]:
for i in range(len(df_301.columns)):
    column_3.append(df_301.columns[i].lower())

In [439]:
df_101.columns= column_1

In [440]:
df_101.columns

Index(['customer', 'st', 'gender', 'education', 'customer lifetime value',
       'income', 'monthly premium auto', 'number of open complaints',
       'policy type', 'vehicle class', 'total claim amount'],
      dtype='object')

In [441]:
df_201.columns= column_2

In [442]:
df_201.columns

Index(['customer', 'st', 'gender', 'education', 'customer lifetime value',
       'income', 'monthly premium auto', 'number of open complaints',
       'total claim amount', 'policy type', 'vehicle class'],
      dtype='object')

In [443]:
df_301.columns= column_3

In [444]:
df_301.columns

Index(['customer', 'state', 'customer lifetime value', 'education', 'gender',
       'income', 'monthly premium auto', 'number of open complaints',
       'policy type', 'total claim amount', 'vehicle class'],
      dtype='object')

In [445]:
#Comparamos si los DataFrames tienen la misma candidad de columnas
set1 = set(column_1)
set2 = set(column_2)
set3 = set(column_3)

# Compara los conjuntos para verificar si son iguales
if set1 == set2 == set3:
    print('Todos los DataFrames tienen las mismas columnas.')
elif set1 == set2:
    print('Archivo uno y dos tienen las mismas columnas')
elif set2 == set3:
    print('Archivo uno y dos tienen las mismas columnas')
else:
    print('No todos los DataFrames tienen las mismas columnas.')

Archivo uno y dos tienen las mismas columnas

In [446]:
df_101.head()

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [447]:
#Ordenamos las columnas en función al primer csv

df_201 = df_201.reindex(columns=['customer', 'st', 'gender', 'education', 'customer lifetime value',
       'income', 'monthly premium auto', 'number of open complaints',
       'policy type', 'vehicle class', 'total claim amount'])

In [448]:
df_201.head()

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,Personal Auto,Four-Door Car,633.6
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,Special Auto,SUV,547.2
2,MY31220,California,F,College,899704.02%,54230,112,1/0/00,Personal Auto,Two-Door Car,537.6
3,UH35128,Oregon,F,College,2580706.30%,71210,214,1/1/00,Personal Auto,Luxury Car,1027.2
4,WH52799,Arizona,F,College,380812.21%,94903,94,1/0/00,Corporate Auto,Two-Door Car,451.2

In [449]:
df_301.head()

,customer,state,customer lifetime value,education,gender,income,monthly premium auto,number of open complaints,policy type,total claim amount,vehicle class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car
2,ZL73902,Nevada,3265.156348,Bachelor,F,25820,82,0,Personal Auto,393.600000,Four-Door Car
3,KX23516,California,4455.843406,High School or Below,F,0,121,0,Personal Auto,699.615192,SUV
4,FN77294,California,7704.958480,High School or Below,M,30366,101,2,Personal Auto,484.800000,SUV

In [450]:
# Renombramos la columna state por st

df_301 =df_301.rename(columns={'state':'st'})

In [451]:
#Ordenamos las columnas en función al primer csv

df_301 = df_301.reindex(columns=['customer', 'st', 'gender', 'education', 'customer lifetime value',
       'income', 'monthly premium auto', 'number of open complaints',
       'policy type', 'vehicle class', 'total claim amount'])

In [452]:
df_301.head()

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,SA25987,Washington,M,High School or Below,3479.137523,0,104,0,Personal Auto,Two-Door Car,499.200000
1,TB86706,Arizona,M,Master,2502.637401,0,66,0,Personal Auto,Two-Door Car,3.468912
2,ZL73902,Nevada,F,Bachelor,3265.156348,25820,82,0,Personal Auto,Four-Door Car,393.600000
3,KX23516,California,F,High School or Below,4455.843406,0,121,0,Personal Auto,SUV,699.615192
4,FN77294,California,M,High School or Below,7704.958480,30366,101,2,Personal Auto,SUV,484.800000

In [453]:
#Comparamos si los DataFrames tienen la misma candidad de columnas
set1 = set(df_101.columns)
set2 = set(df_201.columns)
set3 = set(df_301.columns)

# Compara los conjuntos para verificar si son iguales
if set1 == set2 == set3:
    print('Todos los DataFrames tienen las mismas columnas.')
else:
    print('No todos los DataFrames tienen las mismas columnas.')

Todos los DataFrames tienen las mismas columnas.

In [454]:
df_101.shape

(4008, 11)

In [455]:
df_201.shape

(996, 11)

In [456]:
df_301.shape

(7070, 11)

In [457]:
### Concatenamos los tres archivos

df_all = pd.concat([df_101, df_201, df_301], axis=0)

In [458]:
df_all.shape

(12074, 11)

In [459]:
# Esta es la clase de dato tenemos por columna

df_all.info()

<class 'pandas.core.frame.DataFrame'>
Index: 12074 entries, 0 to 7069
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   9137 non-null   object
 1   st                         9137 non-null   object
 2   gender                     9015 non-null   object
 3   education                  9137 non-null   object
 4   customer lifetime value    9130 non-null   object
 5   income                     9137 non-null   float64
 6   monthly premium auto       9137 non-null   float64
 7   number of open complaints  9137 non-null   object
 8   policy type                9137 non-null   object
 9   vehicle class              9137 non-null   object
 10  total claim amount         9137 non-null   float64
dtypes: float64(3), object(8)
memory usage: 1.1+ MB

In [460]:
df_all.head()

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [461]:
df_all.sample(10)

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
2152,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2104,XG64081,Arizona,M,Bachelor,2759.978287,92296.0,69.0,0,Personal Auto,Two-Door Car,331.200000
320,SC66359,Arizona,F,College,443397.37%,50653.0,110.0,1/0/00,Corporate Auto,SUV,262.865172
3840,RA34556,California,M,High School or Below,4877.954567,20178.0,69.0,2,Corporate Auto,Four-Door Car,331.200000
35,IA62027,Arizona,F,Bachelor,485353.42%,0.0,65.0,1/0/00,Personal Auto,Four-Door Car,468.000000
424,YA80645,Oregon,F,High School or Below,289931.72%,33738.0,74.0,1/1/00,Corporate Auto,Four-Door Car,304.390472
4072,VQ82774,California,F,Master,16301.9676,19614.0,85.0,0,Personal Auto,Two-Door Car,574.024018
452,QY74517,Oregon,F,High School or Below,551055.90%,0.0,73.0,1/0/00,Personal Auto,Four-Door Car,525.600000
2474,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1866,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [462]:
round(df_all.isna().sum()/len(df_all),4)*100

customer                     24.32
st                           24.32
gender                       25.34
education                    24.32
customer lifetime value      24.38
income                       24.32
monthly premium auto         24.32
number of open complaints    24.32
policy type                  24.32
vehicle class                24.32
total claim amount           24.32
dtype: float64

In [463]:
df_all.st.unique()

array(['Washington', 'Arizona', 'Nevada', 'California', 'Oregon', 'Cali',
       'AZ', 'WA', nan], dtype=object)

In [464]:
df_all.st.value_counts()

st
California    3032
Oregon        2601
Arizona       1630
Nevada         882
Washington     768
Cali           120
AZ              74
WA              30
Name: count, dtype: int64

In [465]:
def lim_st(x):
    if x in ['California', 'Cali']:
        return 'California'
    elif x in ['Washington', 'WA']:
        return 'Washington'
    elif x in ['Arizona', 'AZ']:
        return 'Arizona'
    elif x in []:
        return 'NaN'
    else:
        return x

In [466]:
df_all['st']= list(map(lim_st, df_all['st']))

In [467]:
df_all.st.unique()

array(['Washington', 'Arizona', 'Nevada', 'California', 'Oregon', nan],
      dtype=object)

In [468]:
df_all.st.value_counts()

st
California    3152
Oregon        2601
Arizona       1704
Nevada         882
Washington     798
Name: count, dtype: int64

In [469]:
df_all.education.unique()

array(['Master', 'Bachelor', 'High School or Below', 'College',
       'Bachelors', 'Doctor', nan], dtype=object)

In [470]:
df_all.education.value_counts()

education
Bachelor                2719
College                 2682
High School or Below    2616
Master                   752
Doctor                   344
Bachelors                 24
Name: count, dtype: int64

In [471]:
def lim_education(x):
    if x in ['Bachelor', 'Bachelors', 'College']:
        return 'Bachelor'
    else:
        return x

In [472]:
df_all['education']= list(map(lim_education, df_all['education']))

In [473]:
df_all['vehicle class'].unique()

array(['Four-Door Car', 'Two-Door Car', 'SUV', 'Luxury SUV', 'Sports Car',
       'Luxury Car', nan], dtype=object)

In [474]:
df_all.head()

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [475]:
df_all['policy type'].unique()

array(['Personal Auto', 'Corporate Auto', 'Special Auto', nan],
      dtype=object)

In [476]:
# Eliminar columnas 'education', 'number of open complaints'

delete_drop = ['education','number of open complaints']

df_all2 = df_all.drop(delete_drop, axis= 1 )

In [477]:
df_all2.head()

,customer,st,gender,customer lifetime value,income,monthly premium auto,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,NaN,0.0,1000.0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,697953.59%,0.0,94.0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,1288743.17%,48767.0,108.0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,764586.18%,0.0,106.0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,536307.65%,36357.0,68.0,Personal Auto,Four-Door Car,17.269323

In [478]:
# Convertir 'customer lifetime value' en numerico

# Primero debo de eliminar el simbolo de %%!

df_all2['customer lifetime value'] = df_all2['customer lifetime value'].str.replace('%', '').astype(float)

In [479]:
# multiplicar los valores de la columna "customer lifetime value" por 100
df_all2['customer lifetime value'] = df_all2['customer lifetime value'] * 100

# convertir la columna "customer lifetime value" a tipo numérico
df_all2['customer lifetime value'] = pd.to_numeric(df_all2['customer lifetime value'], errors='coerce')

In [480]:
df_all2.head()

,customer,st,gender,customer lifetime value,income,monthly premium auto,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,NaN,0.0,1000.0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,69795359.0,0.0,94.0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,128874317.0,48767.0,108.0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,76458618.0,0.0,106.0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,53630765.0,36357.0,68.0,Personal Auto,Four-Door Car,17.269323

In [481]:
df_all2.shape

(12074, 9)

In [482]:
# Eliminar filas duplicadas

df_all2.drop_duplicates(inplace=True)

In [483]:
df_all2.shape

(9131, 9)

In [485]:
# Filtramos los clientes con ingresos iguales a cero y los quitamos

df_all3 = df_all2.loc[df_all2['income'] > 0]

In [486]:
df_all3.shape

(6837, 9)